tap "buo/cask-upgrade"
tap "candid82/brew"
tap "clintmod/formulas"
tap "cloudflare/cloudflare"
tap "d12frosted/emacs-plus"
tap "go-task/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jason0x43/neovim-nightly"
tap "jez/formulae"
tap "romkatv/powerlevel10k"
tap "xwmx/taps"
tap "yqrashawn/goku"
tap "zegervdv/zathura"
tap "zero-sh/tap"
# Run your GitHub Actions locally 🚀
brew "act"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Google's own build tool
brew "bazel"
# Garbage collector for C and C++
brew "bdw-gc"
# Development kit for the Java programming language
brew "openjdk"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Collection of portable C++ source libraries
brew "boost"
# Freely available high-quality data compressor
brew "bzip2"
# GNU multiple precision arithmetic library
brew "gmp"
# Library for processing command-line flags
brew "gflags"
# Application-level logging library
brew "glog"
# Optimized BLAS library
brew "openblas"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Compression/decompression library aiming for high speed
brew "snappy"
# File format designed to store large amounts of data
brew "hdf5"
# Key-value storage library with ordered mapping
brew "leveldb"
# Lightning memory-mapped database: key-value data store
brew "lmdb"
# Package for scientific computing with Python
brew "numpy"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Toolkit for 3D computer graphics, image processing, and visualization
brew "vtk"
# Open source computer vision library
brew "opencv"
# Fast open framework for deep learning
brew "caffe"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Generate documentation for several programming languages
brew "doxygen"
# Platform built on V8 to build network applications
brew "node"
# Simpler static site generator
brew "eleventy"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Image manipulation
brew "netpbm"
# Framework for layout and rendering of i18n text
brew "pango"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Integrates GTK macOS applications with the Mac desktop
brew "gtk-mac-integration"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Configurable static site generator
brew "hugo"
# Command-line benchmarking tool
brew "hyperfine"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Linear Algebra PACKage
brew "lapack"
# Implementations for atomic memory update operations
brew "libatomic_ops"
# Implementation of the file(1) command
brew "libmagic"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Show markdown documents on text terminals
brew "mdcat"
# Fast and user friendly build system
brew "meson"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Render and include figures in Pandoc documents using many plotting toolkits
brew "pandoc-plot"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Alternative to pyenv for managing virtualenvs
brew "pyenv-virtualenvwrapper"
# Software environment for statistical computing
brew "r", link: false
# File browser
brew "ranger"
# Ruby version manager
brew "rbenv"
# Rsync for cloud storage
brew "rclone"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Intuitive find & replace CLI
brew "sd"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Command-line YAML parser
brew "shyaml"
# Fuzzy Finder in rust!
brew "sk"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# Implementation of extended-Rice lossless compression algorithm
brew "szip", link: true
# Modernized, complete, self-contained TeX/LaTeX engine
brew "tectonic"
# Official documentation format of the GNU project
brew "texinfo"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Linear algebra library for many-core architectures and multi-core CPUs
brew "viennacl"
# Vi 'workalike' with many additional features
brew "vim"
# Image processing library
brew "vips"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Access X11 clipboards from the command-line
brew "xclip"
# JavaScript package manager
brew "yarn"
# General-purpose lossless data-compression library
brew "zlib"
# Cloudflare Tunnel
brew "cloudflare/cloudflare/cloudflared"
# Task runner / simpler Make alternative written in Go
brew "go-task/tap/go-task"
# Convert Pandoc Markdown-style footnotes into sidenotes
brew "jez/formulae/pandoc-sidenote"
brew "xwmx/taps/nb"
# karabiner configurator
brew "yqrashawn/goku/goku"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Application launcher and productivity software
cask "alfred"
# Application uninstaller
cask "appcleaner"
# Free and open-source web browser
cask "chromium"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Block websites, games and applications
cask "cold-turkey-blocker"
# API documentation browser and code snippet manager
cask "dash"
# App to build and share containerized applications and microservices
cask "docker"
# Calendar software
cask "fantastical"
# Reimagine your terminal
cask "fig"
# Web browser
cask "firefox"
# Monospaced font that includes programming ligatures
cask "font-cascadia-code"
# Version of Cascadia Code with embedded Powerline symbols
cask "font-cascadia-code-pl"
# Version of Cascadia Code without ligatures
cask "font-cascadia-mono"
# Version of Cascadia Code without ligatures and with embedded Powerline symbols
cask "font-cascadia-mono-pl"
cask "font-caskaydia-cove-nerd-font"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
# Typeface made for developers
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-noto-serif-cjk-jp"
cask "font-noto-serif-cjk-kr"
cask "font-noto-serif-cjk-sc"
cask "font-noto-serif-cjk-tc"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Vector graphics editor
cask "inkscape"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customizer
cask "karabiner-elements"
# Tool to show what is persistently installed on the computer
cask "knockknock"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Scanner app for math and science
cask "mathpix-snipping-tool"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# App to write, plan, collaborate, and get organized
cask "notion"
# Desktop virtualization software
cask "parallels"
# Environment for statistical computing and graphics
cask "r"
# Data science software focusing on R and Python
cask "rstudio"
# Collection of apps available by subscription
cask "setapp"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
cask "tikz-editor"
# File transfer application
cask "transmit"
# VPN client for secure internet access and private browsing
cask "tunnelbear"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Craft", id: 1487937127
mas "Divvy", id: 413857545
mas "GeoGebra Classic 6", id: 1182481622
mas "Grocery", id: 1195676848
mas "HomeControl", id: 1547121417
mas "Notability", id: 360593530
mas "Save to Raindrop.io", id: 1549370672
mas "Speedtest", id: 1153157709
mas "Things", id: 904280696
mas "TweetDeck", id: 485812721
mas "Twitter", id: 1482454543
mas "WhatsApp", id: 1147396723
