tap "azure/azd"
tap "buo/cask-upgrade"
tap "candid82/brew"
tap "gcenx/wine"
tap "go-task/tap"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jason0x43/neovim-nightly"
tap "jez/formulae"
tap "romkatv/powerlevel10k"
tap "xwmx/taps"
tap "yqrashawn/goku"
# Run your GitHub Actions locally
brew "act"
# Core application library for C
brew "glib"
# GNOME accessibility toolkit
brew "atk"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Bash Automated Testing System
brew "bats-core"
# Vector graphics library with cross-device output support
brew "cairo"
# OpenType text shaping engine
brew "harfbuzz"
# Google's own build tool
brew "bazel"
# Garbage collector for C and C++
brew "bdw-gc"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Collection of portable C++ source libraries
brew "boost"
# Freely available high-quality data compressor
brew "bzip2"
# Library for processing command-line flags
brew "gflags"
# Application-level logging library
brew "glog"
# Optimized BLAS library
brew "openblas"
# C++ library for large-scale optimization
brew "ceres-solver"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Framework for layout and rendering of i18n text
brew "pango"
# Compression/decompression library aiming for high speed
brew "snappy"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# File format designed to store large amounts of data
brew "hdf5"
# Key-value storage library with ordered mapping
brew "leveldb"
# Lightning memory-mapped database: key-value data store
brew "lmdb"
# Package for scientific computing with Python
brew "numpy"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Python bindings for v5 of Qt
brew "pyqt@5"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Toolkit for 3D computer graphics, image processing, and visualization
brew "vtk"
# Open source computer vision library
brew "opencv"
# Fast open framework for deep learning
brew "caffe"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Cross-platform make
brew "cmake"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Defines a standard way of committing rules and communicating it
brew "commitizen"
# Utility that creates projects from templates
brew "cookiecutter"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Clean Docker containers, images, networks, and volumes
brew "docker-clean"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Modern replacement for 'ls'
brew "exa"
# Command-line tool to interact with exercism.io
brew "exercism"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg@4"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Firebase command-line tools
brew "firebase-cli"
# Command-line fuzzy finder written in Go
brew "fzf"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Fast linters runner for Go
brew "golangci-lint"
# Image manipulation
brew "netpbm"
# GNU triangulated surface library
brew "gts"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Command-line tool for generating regular expressions
brew "grex"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# GUI toolkit
brew "gtk+"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Integrates GTK macOS applications with the Mac desktop
brew "gtk-mac-integration"
# Post-modern modal text editor
brew "helix"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Command-line benchmarking tool
brew "hyperfine"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# C/C++ seam carving library
brew "liblqr"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Linear Algebra PACKage
brew "lapack"
# Implementations for atomic memory update operations
brew "libatomic_ops"
# Asynchronous event library
brew "libev"
# I/O abstraction library for dealing with structured file formats
brew "libgsf"
# Implementation of the file(1) command
brew "libmagic"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Show markdown documents on text terminals
brew "mdcat"
# Fast and user friendly build system
brew "meson"
# Port scanning utility for large networks
brew "nmap"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Command-line and local web note‑taking, bookmarking, and archiving
brew "nb"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# C library to read whole-slide images (a.k.a. virtual slides)
brew "openslide"
# Render and include figures in Pandoc documents using many plotting toolkits
brew "pandoc-plot"
# Modern Python package and dependency manager supporting the latest PEP standards
brew "pdm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@15", link: true
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Cross-platform application and UI framework
brew "qt"
# Develop and deploy code with zero configuration
brew "railway"
# File browser
brew "ranger"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Rsync for cloud storage
brew "rclone"
# Rust toolchain installer
brew "rustup-init"
# Intuitive find & replace CLI
brew "sd"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Fuzzy Finder in rust!
brew "sk"
# SMART hard drive monitoring
brew "smartmontools"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Strong open-source chess engine
brew "stockfish"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Modernized, complete, self-contained TeX/LaTeX engine
brew "tectonic"
# Official documentation format of the GNU project
brew "texinfo"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Linear algebra library for many-core architectures and multi-core CPUs
brew "viennacl"
# Vi 'workalike' with many additional features
brew "vim"
# Image processing library
brew "vips"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Access X11 clipboards from the command-line
brew "xclip"
# JavaScript package manager
brew "yarn"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Azure Developer CLI
brew "azure/azd/azd"
# Task runner / simpler Make alternative written in Go
brew "go-task/tap/go-task"
# karabiner configurator
brew "yqrashawn/goku/goku"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line helper for the 1Password password manager
cask "1password-cli-beta"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Tools for building Android applications
cask "android-studio"
# Application uninstaller
cask "appcleaner"
# Data backup and storage service
cask "backblaze"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# 3D creation suite
cask "blender"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Utility to finds and fix problems on computer systems
cask "etrecheckpro"
# VPN client for secure internet access and private browsing
cask "expressvpn"
# Calendar software
cask "fantastical"
# Reimagine your terminal
cask "fig"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Developer targeted fonts with a high number of glyphs
cask "font-caskaydia-cove-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
# Typeface made for developers
cask "font-jetbrains-mono"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customizer
cask "karabiner-elements"
# Interface for reading and syncing eBooks
cask "kindle"
# Update your Logitech wireless receivers and selected keyboards
cask "logitech-firmwareupdatetool"
# Scanner app for math and science
cask "mathpix-snipping-tool"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Desktop virtualization software
cask "parallels"
# PDF reader, editor and annotator
cask "pdf-expert"
# App wrapper for Postgres
cask "postgres-unofficial"
# All-in-one bookmark manager
cask "raindropio"
# Control your tools with a few keystrokes
cask "raycast"
# Collection of apps available by subscription
cask "setapp"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Customize mouse buttons, wheels and cursor speed
cask "steermouse"
# Unpacks archive files
cask "the-unarchiver"
# Utility to change the default backup interval of Time Machine
cask "timemachineeditor"
# File transfer application
cask "transmit"
# Open-source code editor
cask "visual-studio-code"
# Remote desktop application focusing on security
cask "vnc-viewer"
# Resources for Wacom tablets
cask "wacom-tablet"
# Porting tool, to make Windows programs/games into native apps
cask "wineskin"
# Video communication and virtual meeting platform
cask "zoom"
